Autodesk.Revit.DB.BRepBuilder.SetEdgeHidden(Autodesk.Revit.DB.BRepBuilderGeometryId,System.Boolean)
Make BRepBuilder allow edges to be hidden.
Remarks:
Set the edge to be hidden.
edgeId:
Id of the edge
hidden:
True for hidden
Throws Autodesk.Revit.Exceptions.ArgumentException:
The supplied edge id doesn't correspond to an edge stored in this BRepBuilder object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.BRepBuilder.SetFacePatternPlacement(Autodesk.Revit.DB.BRepBuilderGeometryId,Autodesk.Revit.DB.PatternPlacer,System.Boolean)
Sets pattern placement of material on a face.
faceId:
Id of the face to which material id will be added. faceId was returned by a call to AddFace().
pattern:
Pattern placer of material on the face.
background:
True to set the pattern placement for background of the face, otherwise foreground
Throws Autodesk.Revit.Exceptions.ArgumentException:
The supplied face id doesn't correspond to a face stored in this BRepBuilder object.
-or-
The input face doesn't have a material assigned with Autodesk.Revit.DB.BRepBuilder.SetFaceMaterialId(Autodesk.Revit.DB.BRepBuilderGeometryId,Autodesk.Revit.DB.ElementId).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016